{
  "branchName": "ralph/answerer-contexts-mode",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add output_mode option to Answerer executions in API and models",
      "acceptanceCriteria": [
        "ExecutionOptions includes output_mode with allowed values ANSWER and CONTEXTS, defaulting to ANSWER when omitted.",
        "CreateExecutionRequest accepts options.output_mode and the execution record persists the value in DynamoDB.",
        "ExecutionStatusResponse and ExecutionListItem include output_mode reflecting the stored value.",
        "Existing executions without output_mode return output_mode=ANSWER in API responses.",
        "Typecheck passes: uv run ruff check . exits 0.",
        "Tests pass: uv run pytest -q tests/unit -k execution_output_mode exits 0."
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement contexts output mode in root prompt and orchestrator finalization",
      "acceptanceCriteria": [
        "Root prompt builder selects a contexts template when output_mode=CONTEXTS and instructs the model to tag returnable spans using tag values of context or context:<suffix>.",
        "Orchestrator finalization in contexts mode ignores tool.FINAL answer text and produces contexts only from span_log entries whose tag is exactly context or starts with context:.",
        "Contexts are ordered by global discovery sequence using turn_index then in turn span order, and include full canonical text slices.",
        "Duplicate spans with identical doc_index,start_char,end_char are de-duplicated keeping the earliest sequence and preserving the remaining order.",
        "Citations are generated from the same context spans and are 1:1 with contexts by SpanRef checksum.",
        "Execution completes with answer null and no evaluation record is created when output_mode=CONTEXTS.",
        "Integration test uses FakeLLMProvider to tag context spans with both context and context:foo, includes a non-context tag, and verifies only the matching tags are included in contexts.",
        "Integration test verifies status COMPLETED, contexts present, and citations verify via POST /v1/citations/verify.",
        "Typecheck passes: uv run ruff check . exits 0.",
        "Tests pass: uv run pytest -q tests/integration -k answerer_contexts exits 0."
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Persist and retrieve contexts payloads with S3 offload",
      "acceptanceCriteria": [
        "Contexts payloads are stored inline on the execution item when under the existing inline payload limit, otherwise written to S3 with contexts_s3_uri populated.",
        "GET /v1/executions/{execution_id} returns contexts when inline and returns contexts_s3_uri when offloaded, with answer explicitly null in contexts mode.",
        "GET /v1/executions/{execution_id}/contexts returns the full contexts payload regardless of storage location and enforces tenant access.",
        "Unit test forces offload by injecting a small inline size limit and verifies the contexts payload round trips from S3 unchanged.",
        "Typecheck passes: uv run ruff check . exits 0.",
        "Tests pass: uv run pytest -q tests/unit -k contexts_payload exits 0."
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Define and expose context item schema for clients",
      "acceptanceCriteria": [
        "Context item schema includes: sequence_index, turn_index, span_index, tag, text, text_char_length, source_name, mime_type, and ref (SpanRef) with tenant_id, session_id, doc_id, doc_index, start_char, end_char, checksum.",
        "Contexts include full text sections with no truncation; collapsed rendering is handled by the UI only.",
        "sequence_index is global discovery order across all turns and is contiguous starting at 0.",
        "turn_index and span_index are present on every context item and match the originating step and in turn order.",
        "API responses use the context schema for both inline contexts and /contexts endpoint.",
        "Typecheck passes: uv run ruff check . exits 0.",
        "Tests pass: uv run pytest -q tests/unit -k context_schema exits 0."
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Include turn_index on root repl code log entries",
      "acceptanceCriteria": [
        "Root repl code log entries include turn_index and it is persisted in the code_log table.",
        "Code log API response includes turn_index for repl entries and UI types include the field.",
        "Unit test asserts turn_index is present and increases for multi turn answerer executions.",
        "Typecheck passes: uv run ruff check . exits 0.",
        "Tests pass: uv run pytest -q tests/unit -k code_log_turn_index exits 0."
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Add Answerer output mode selection in UI and surface it in executions list",
      "acceptanceCriteria": [
        "Start Answerer modal includes an Output Mode selector with Answer and Contexts options and defaults to Answer.",
        "Selecting Contexts sends options.output_mode=CONTEXTS in the create execution request.",
        "Executions list displays an Output Mode badge or label for Answerer executions that shows Contexts when applicable.",
        "Playwright MCP checks: use browser_navigate to /sessions/{session_id}, browser_click to open Start Answerer modal, browser_snapshot to verify Output Mode control, browser_click to select Contexts, submit, then browser_navigate to /executions and browser_snapshot to verify the Contexts badge on the new execution.",
        "Typecheck passes: npm run typecheck --prefix ui exits 0.",
        "Tests pass: npm test --prefix ui exits 0."
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Render contexts focused execution detail layout in UI",
      "acceptanceCriteria": [
        "When output_mode=CONTEXTS, the execution detail page renders Context Timeline and Context Inspector sections instead of Answer and Baseline panels.",
        "Context items are collapsed by default and expand to show full text, with discovery order shown using sequence_index and turn_index.",
        "Selecting a context shows metadata, citation link with full SpanRef query params, and the repl code for the same turn using the code log, with a visible empty state when code is unavailable.",
        "Timeline order follows sequence_index and the UI displays the order index for each context in ascending order.",
        "When contexts_s3_uri is present, the UI loads contexts via GET /v1/executions/{execution_id}/contexts before rendering the timeline.",
        "Playwright MCP checks: browser_navigate to a contexts execution detail page, browser_snapshot to verify Context Timeline and Context Inspector headings, browser_snapshot to verify contexts are collapsed initially, browser_click the first context row, browser_snapshot to verify metadata and citation link, browser_click to expand full text, then browser_click another context and browser_snapshot to verify repl code block updates.",
        "Typecheck passes: npm run typecheck --prefix ui exits 0.",
        "Tests pass: npm test --prefix ui exits 0."
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Update specs and UI documentation for contexts mode",
      "acceptanceCriteria": [
        "docs/rls_spec.md documents output_mode=CONTEXTS, tag matching rules (context or context:*), context schema fields, and response fields contexts and contexts_s3_uri.",
        "docs/sequence.md includes the contexts completion path without a final answer and mentions context tag usage.",
        "docs/ui_spec.md documents the Output Mode selector and the Contexts execution layout with timeline and inspector.",
        "Docs verification: rg -n \"output_mode|contexts_s3_uri|sequence_index|context:\" docs/rls_spec.md docs/sequence.md docs/ui_spec.md returns matches.",
        "Typecheck passes: uv run ruff check . exits 0.",
        "Tests pass: uv run pytest -q exits 0."
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    }
  ]
}
